Revit 2016 API
LineLoad.ProjectedLoad Property
 Indicates if the load is projected.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use IsProjected instead.")]
public bool ProjectedLoad { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use IsProjected instead.")> _
Public ReadOnly Property ProjectedLoad As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use IsProjected instead.")]
public:
property bool ProjectedLoad {
	bool get ();
}
Remarks
 This parameter will take effect only if LineLoad.OrientTo property is set to LoadOrientTo.Project.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace